In [21]:
import pandas as pd
import pymongo

# Connect to MongoDB
client = pymongo.MongoClient("mongodb://192.168.3.82:27017/")

# List existing databases
print("Existing databases:")
print(client.list_database_names())

Existing databases:
['admin', 'config', 'local', 'snake_bnb', 'vehicle_insurance']

In [22]:
# Create a new database (MongoDB creates it when you insert data)
# Just reference the database name - it will be created automatically

db_name = "vehicle_insurance"  # Change this to your desired database name
collection_name = "vehicle_insurance_data"  # Change this to your desired collection name

db = client[db_name]
collection = db[collection_name]

print(f"Database '{db_name}' and collection '{collection_name}' are ready!")
print(f"Note: The database will appear in the list only after inserting data.")

Database 'vehicle_insurance' and collection 'vehicle_insurance_data' are ready!
Note: The database will appear in the list only after inserting data.

In [23]:
# Load CSV data
df = pd.read_csv('data.csv')
print(f"Loaded {len(df)} records from CSV")
df.head()

Loaded 381109 records from CSV

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0
2,3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1
3,4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0
4,5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0

In [24]:
# Convert DataFrame to list of dictionaries and insert into MongoDB
data = df.to_dict(orient='records')

# Insert data into MongoDB (this also creates the database and collection)
collection.insert_many(data)
print(f"Successfully inserted {len(data)} records into MongoDB!")

# Verify the database now exists
print("\nDatabases after insertion:")
print(client.list_database_names())

Successfully inserted 381109 records into MongoDB!

Databases after insertion:
['admin', 'config', 'local', 'snake_bnb', 'vehicle_insurance']

In [25]:
# Retrieve data from MongoDB
cursor = collection.find()
retrieved_data = list(cursor)

# Convert to DataFrame
df_from_mongo = pd.DataFrame(retrieved_data)

# Drop the MongoDB _id column
if '_id' in df_from_mongo.columns:
    df_from_mongo = df_from_mongo.drop('_id', axis=1)

print(f"Retrieved {len(df_from_mongo)} records from MongoDB")
df_from_mongo.head()

Retrieved 762218 records from MongoDB

,id,Gender,Age,Driving_License,Region_Code,Previously_Insured,Vehicle_Age,Vehicle_Damage,Annual_Premium,Policy_Sales_Channel,Vintage,Response
0,1,Male,44,1,28.0,0,> 2 Years,Yes,40454.0,26.0,217,1
1,2,Male,76,1,3.0,0,1-2 Year,No,33536.0,26.0,183,0
2,3,Male,47,1,28.0,0,> 2 Years,Yes,38294.0,26.0,27,1
3,4,Male,21,1,11.0,1,< 1 Year,No,28619.0,152.0,203,0
4,5,Female,29,1,41.0,1,< 1 Year,No,27496.0,152.0,39,0

In [26]:
import pandas as pd
import pymongo

# In Jupyter notebook, use relative path (notebook is in same folder as data.csv)
df = pd.read_csv('data.csv')

In [27]:
# df should be converted into dict before we push it to mongodb

data = df.to_dict(orient='records')